**<b><font color="red">ch10. 데이터베이스 연동</font><b>**

# 1절. SQLite 데이터 베이스 연결

## 1.1 SQLite 와 Python
- SQLite 데이터 베이스는 별도의 서버프로세스 없이 SQL을 사용하여 DB엑세스할 수 있도록 만든 간단한 **디스크 기반(파일기반) 데이터베이스를 제공**하는 c라이브러리.
- SQLite는 프로토타입(프로토타입 : 시제품 나오기전 까지 제품)을 만들때까지 사용.
- 정식 제품은 오라클이나 다른 DBMS를 이식해서 출품한다.
- DB browser for SQLite(https://sqlitebrowser.org/dl/)

In [2]:
import sqlite3 # 실행 되면 다운성공.
sqlite3.sqlite_version #버젼 확인.

'3.33.0'

### 1.2 데이터 베이스 연결

In [37]:
# DB 연결 객체 생성시, 파일이 없으면 파일이 생성된다. 파일이 있으면 그 파일 연결해서 연동.
conn = sqlite3.connect('data/ch10.example.db')
conn

In [6]:
%ls data

 E 드라이브의 볼륨: 학생방
 볼륨 일련 번호: 0282-0516

 E:\WDS\BigDataUI\data\src\08.Python\data 디렉터리

2021-03-03  오전 10:39    <DIR>          .
2021-03-03  오전 10:39    <DIR>          ..
2021-02-26  오후 03:03    <DIR>          .ipynb_checkpoints
2021-02-26  오후 03:02                44 ch08.abc.txt
2021-03-02  오후 01:20           292,544 ch09.iris.hdf5
2021-03-02  오후 02:45         1,069,192 ch09.iris2.hdf5
2021-02-26  오후 06:19               230 ch09.member.data
2021-02-26  오후 06:12               112 ch09.member.txt
2021-03-02  오전 10:08               162 ch09.member1.csv
2021-03-02  오후 12:15               192 ch09.member1.json
2021-03-02  오전 11:05                92 ch09.member1-1.csv
2021-03-02  오전 10:16                68 ch09.member2.csv
2021-03-02  오후 12:36               279 ch09.member2.json
2021-03-02  오전 10:22                70 ch09.member2-1.csv
2021-03-02  오전 11:21               136 ch09.member3.csv
2021-03-02  오전 11:49               126 ch09.member4.csv
2021-03-02  오전 11:57               126 ch09.member5.csv
2021-02-26  오후 05:47               373 ch09.sample.txt
2021-03-03  오전 10:39             8,192 ch10.example.db
2021-03-03  오전 10:39             1,206 ch10.example.sqbpro
              17개 파일           1,373,144 바이트
               3개 디렉터리  410,817,421,312 바이트 남음

In [8]:
conn.close() # 꼭 닫아줘야한다.

In [38]:
#cursor(커서) 객체 반환. cursor(커서) : SQL문을 실행시키고 결과데이터를 조회하는데 사용
cursor = conn.cursor()

In [13]:
cursor.execute("""
        CREATE TABLE MEMBER (
            NAME TEXT,
            AGE INT,
            EMAIL TEXT
        )
""")

In [16]:
cursor.execute("DROP TABLE MEMBER") # 삭제.

In [17]:
cursor.execute("""
        CREATE TABLE MEMBER (
            NAME TEXT,
            AGE INT,
            EMAIL TEXT
        )
""")

In [19]:
cursor.execute("INSERT INTO MEMBER VALUES ('홍길동',20,'h@hong.com')")
cursor.execute("INSERT INTO MEMBER VALUES ('유길동',23,'y@hong.com')")
cursor.execute("INSERT INTO MEMBER VALUES ('마길동',30,'m@hong.com')")

In [21]:
conn.commit() # (반) conn.rollback()

In [22]:
cursor.execute("SELECT * FROM MEMBER") # select 의 실행결과는 cursor 가 가르키고 있다.

In [23]:
# select 문의 결과를 받는 함수 : fetchall() => 결과를 모두 받을때
#fetchone() => 결과를 한 행씩 받을때
#fetchmay(n-> 숫자) => 결과를 n행 받을때
print(cursor.fetchall()) # execute 실행 결과는 튜플로 나온다.

[('홍길동', 20, 'h@hong.com'), ('홍길동', 20, 'h@hong.com'), ('홍길동', 20, 'h@hong.com'), ('홍길동', 20, 'h@hong.com'), ('유길동', 23, 'y@hong.com'), ('마길동', 30, 'm@hong.com')]

In [24]:
print(cursor.fetchall()) # 한번더 출력시키면 아무것도 나오지 않는다.

[]

In [25]:
cursor.execute("SELECT * FROM MEMBER")
members = cursor.fetchall() # 그래서 변수에 넣어야 계속 이용할수 있다.
for member in  members:
    print(member)

('홍길동', 20, 'h@hong.com')
('홍길동', 20, 'h@hong.com')
('홍길동', 20, 'h@hong.com')
('홍길동', 20, 'h@hong.com')
('유길동', 23, 'y@hong.com')
('마길동', 30, 'm@hong.com')

In [27]:
members[0]

('홍길동', 20, 'h@hong.com')

In [30]:
cursor.execute("SELECT * FROM MEMBER")
while True:
    member = cursor.fetchone()
    if member is None:   # => member가 None 이면.
        break;
    print(member)
# print(cursor.fetchone())
# print(cursor.fetchone())
# print(cursor.fetchone())
# print(cursor.fetchone())
# print(cursor.fetchone())
# print(cursor.fetchone())
# print(cursor.fetchone()) # 더이상 없으면 None 으로 출력.

('홍길동', 20, 'h@hong.com')
('홍길동', 20, 'h@hong.com')
('홍길동', 20, 'h@hong.com')
('홍길동', 20, 'h@hong.com')
('유길동', 23, 'y@hong.com')
('마길동', 30, 'm@hong.com')

In [31]:
cursor.execute("SELECT * FROM MEMBER")
for member in cursor.fetchmany(2):
    print(member)
    #print(member[0],member[1],member[2]) 따로 따로.

('홍길동', 20, 'h@hong.com')
('홍길동', 20, 'h@hong.com')

In [32]:
cursor.fetchmany(2) # 한번 fet 하면 그 다음 fet를 보여준다.

[('홍길동', 20, 'h@hong.com'), ('홍길동', 20, 'h@hong.com')]

In [39]:
cursor.close() # cursor 닫음. => 이 문장을 생략했을경우 conn은 꼭 닫기 해줘야함.
conn.close() 
# 한번더 하면 없다고 에러.

## 1.3 SQL 구문에 파라미터 사용하기(where조건에 많이 쓰임)
- qmark, named 방법들중, named 를 추천한다.

In [41]:
conn = sqlite3.connect('data/ch10.example.db') #db연동
cursor = conn.cursor() # cursor 실행
cursor.execute("SELECT * FROM MEMBER WHERE NAME IN ('홍길동','마길동')")
print(cursor.fetchall())

[('홍길동', 20, 'h@hong.com'), ('홍길동', 20, 'h@hong.com'), ('홍길동', 20, 'h@hong.com'), ('홍길동', 20, 'h@hong.com'), ('마길동', 30, 'm@hong.com')]

In [42]:
# 파라미터 사용하기 : qmark 방법이용.
conn = sqlite3.connect('data/ch10.example.db') #db연동
cursor = conn.cursor() # cursor 객체 생성.
#cursor.execute("SELECT * FROM MEMBER WHERE NAME IN ('"+name1+"','"+name2+"')")
# 이렇게 하지 않음. 가독성이 너무 떨어짐.
cursor.execute("SELECT * FROM MEMBER WHERE NAME IN (?,?)",('홍길동','마길동'))
# ('홍길동','마길동') => 튜플로 들어옴.
print(cursor.fetchall())

[('홍길동', 20, 'h@hong.com'), ('홍길동', 20, 'h@hong.com'), ('홍길동', 20, 'h@hong.com'), ('홍길동', 20, 'h@hong.com'), ('마길동', 30, 'm@hong.com')]

In [44]:
name1 = input('검색할 이름1 : ')
name2 = input('검색할 이름2 : ')
names = (name1,name2)
cursor.execute("SELECT * FROM MEMBER WHERE NAME IN (?,?)", names)
print(cursor.fetchall())

검색할 이름1 : 마길동
검색할 이름2 : 윤길동
[('마길동', 30, 'm@hong.com')]

In [49]:
# 파라미터 사용하기 : named 방법이용.
name = input("검색하고자 하는 이름 : ")
cursor.execute("SELECT * FROM MEMBER WHERE NAME =:name", {'name':name})
members = cursor.fetchall()
if len(members) == 0: # 없는 이름을 없다고 출력.
    print('해당 이름의 데이터가 없습니다.')
else:
    print(cursor.fetchall())
# 없는 이름을 검색하면 빈리스트로 출력된다.

검색하고자 하는 이름 : 윤길동
해당 이름의 데이터가 없습니다.

In [51]:
name = input('입력할 이름 ?')
try: #예외가 날 곳에만. 아닌것들은 따로 빼준다.
    age = int(input('입력할 나이 ?'))
except:
    print('나이를 잘못 입력 하셨어요. 초기값인 20살로.')
    age = 20
email = input('입력할 이메일 ?')
cursor.execute("INSERT INTO MEMBER VALUES (:name,:age,:email)",
               {'name':name, 'age':age, 'email':email} )
# {'name':name, 'age':age, 'email':email} 딕셔너리가 와야한다.

입력할 이름 ?신길동
입력할 나이 ?29
입력할 이메일 ?shin@hong.com

In [52]:
cursor.execute("SELECT * FROM MEMBER")
print(cursor.fetchall())

[('홍길동', 20, 'h@hong.com'), ('홍길동', 20, 'h@hong.com'), ('홍길동', 20, 'h@hong.com'), ('홍길동', 20, 'h@hong.com'), ('유길동', 23, 'y@hong.com'), ('마길동', 30, 'm@hong.com'), ('신길동', 29, 'shin@hong.com')]

In [53]:
cursor.close()
conn.close() # conn만 닫으면 cursor 도 닫아진다.

# 2절. 오라클 데이터베이스 연결

In [55]:
#데이터베이스 설정(DBMS가 있는 서버 주소,포트번호, sid 등을 설정)
import cx_Oracle
oracle_dsn = cx_Oracle.makedsn(host="localhost", port=1521, sid = "xe")
oracle_dsn

'(DESCRIPTION=(ADDRESS=(PROTOCOL=TCP)(HOST=localhost)(PORT=1521))(CONNECT_DATA=(SID=xe)))'

In [56]:
conn = cx_Oracle.connect("scott","tiger", dsn = oracle_dsn)
conn
#에러가 날 경우.
# VC_redist.x64.exe 인스톨.

In [57]:
conn.close()

In [61]:
# conn 얻어오는 방법 (1안.) 이 방법을 많이 쓰인다.
oracle_dsn = cx_Oracle.makedsn(host="localhost", port=1521, sid = "xe")
conn = cx_Oracle.connect("scott","tiger", dsn = oracle_dsn)

In [62]:
conn.close()

In [63]:
# conn 얻어오는 방법 (2안.)
conn = cx_Oracle.connect("scott", "tiger", "localhost:1521/xe")
conn

In [64]:
# cursor 얻어오기
cursor = conn.cursor()

In [67]:
sql = "SELECT * FROM EMP"
cursor.execute(sql)
# emp = cursor.fetchall()
for e in cursor:
    print(e)

(7369, 'SMITH', 'CLERK', 7902, datetime.datetime(1980, 12, 17, 0, 0), 800.0, None, 20)
(7499, 'ALLEN', 'SALESMAN', 7698, datetime.datetime(1981, 2, 20, 0, 0), 1600.0, 300.0, 30)
(7521, 'WARD', 'SALESMAN', 7698, datetime.datetime(1981, 2, 22, 0, 0), 1250.0, 500.0, 30)
(7566, 'JONES', 'MANAGER', 7839, datetime.datetime(1981, 4, 2, 0, 0), 2975.0, None, 20)
(7654, 'MARTIN', 'SALESMAN', 7698, datetime.datetime(1981, 9, 28, 0, 0), 1250.0, 1400.0, 30)
(7698, 'BLAKE', 'MANAGER', 7839, datetime.datetime(1981, 5, 1, 0, 0), 2850.0, None, 30)
(7782, 'CLARK', 'MANAGER', 7839, datetime.datetime(1981, 6, 9, 0, 0), 2450.0, None, 10)
(7788, 'SCOTT', 'ANALYST', 7566, datetime.datetime(1982, 12, 9, 0, 0), 3000.0, None, 20)
(7839, 'KING', 'PRESIDENT', None, datetime.datetime(1981, 11, 17, 0, 0), 5000.0, None, 10)
(7844, 'TURNER', 'SALESMAN', 7698, datetime.datetime(1981, 9, 8, 0, 0), 1500.0, 0.0, 30)
(7876, 'ADAMS', 'CLERK', 7788, datetime.datetime(1983, 1, 12, 0, 0), 1100.0, None, 20)
(7900, 'JAMES', 'CLERK', 7698, datetime.datetime(1981, 12, 3, 0, 0), 950.0, None, 30)
(7902, 'FORD', 'ANALYST', 7566, datetime.datetime(1981, 12, 3, 0, 0), 3000.0, None, 20)
(7934, 'MILLER', 'CLERK', 7782, datetime.datetime(1982, 1, 23, 0, 0), 1300.0, None, 10)

In [66]:
for e in emp:
    print(e) # 튜플 타입.

(7369, 'SMITH', 'CLERK', 7902, datetime.datetime(1980, 12, 17, 0, 0), 800.0, None, 20)
(7499, 'ALLEN', 'SALESMAN', 7698, datetime.datetime(1981, 2, 20, 0, 0), 1600.0, 300.0, 30)
(7521, 'WARD', 'SALESMAN', 7698, datetime.datetime(1981, 2, 22, 0, 0), 1250.0, 500.0, 30)
(7566, 'JONES', 'MANAGER', 7839, datetime.datetime(1981, 4, 2, 0, 0), 2975.0, None, 20)
(7654, 'MARTIN', 'SALESMAN', 7698, datetime.datetime(1981, 9, 28, 0, 0), 1250.0, 1400.0, 30)
(7698, 'BLAKE', 'MANAGER', 7839, datetime.datetime(1981, 5, 1, 0, 0), 2850.0, None, 30)
(7782, 'CLARK', 'MANAGER', 7839, datetime.datetime(1981, 6, 9, 0, 0), 2450.0, None, 10)
(7788, 'SCOTT', 'ANALYST', 7566, datetime.datetime(1982, 12, 9, 0, 0), 3000.0, None, 20)
(7839, 'KING', 'PRESIDENT', None, datetime.datetime(1981, 11, 17, 0, 0), 5000.0, None, 10)
(7844, 'TURNER', 'SALESMAN', 7698, datetime.datetime(1981, 9, 8, 0, 0), 1500.0, 0.0, 30)
(7876, 'ADAMS', 'CLERK', 7788, datetime.datetime(1983, 1, 12, 0, 0), 1100.0, None, 20)
(7900, 'JAMES', 'CLERK', 7698, datetime.datetime(1981, 12, 3, 0, 0), 950.0, None, 30)
(7902, 'FORD', 'ANALYST', 7566, datetime.datetime(1981, 12, 3, 0, 0), 3000.0, None, 20)
(7934, 'MILLER', 'CLERK', 7782, datetime.datetime(1982, 1, 23, 0, 0), 1300.0, None, 10)

In [70]:
sql = "SELECT * FROM EMP WHERE DEPTNO =:deptno"
deptno = input('검색 하고자 하는 부서 번호는 ? ')
cursor.execute(sql, {'deptno':deptno})

for emp in cursor:
    print(emp)

검색 하고자 하는 부서 번호는 ? 40

In [71]:
sql = "SELECT * FROM EMP WHERE DEPTNO =:deptno"
deptno = input('검색 하고자 하는 부서 번호는 ? ')
cursor.execute(sql, {'deptno':deptno})

emp = cursor.fetchall()
if len(emp)==0:
    print('입력하신 부서번호의 데이터가 없습니다.')
else:
    for e in emp:
        print(e)

검색 하고자 하는 부서 번호는 ? 50
입력하신 부서번호의 데이터가 없습니다.

In [1]:
print(emp)

NameError: name 'emp' is not defined

In [74]:
import pandas as pd
cursor.execute("SELECT * FROM EMP")
data = cursor.fetchall() #튜플 리스트.
data_df = pd.DataFrame(data) #데이터프레임 타입으로.
data_df

       0       1          2       3          4       5       6   7
0   7369   SMITH      CLERK  7902.0 1980-12-17   800.0     NaN  20
1   7499   ALLEN   SALESMAN  7698.0 1981-02-20  1600.0   300.0  30
2   7521    WARD   SALESMAN  7698.0 1981-02-22  1250.0   500.0  30
3   7566   JONES    MANAGER  7839.0 1981-04-02  2975.0     NaN  20
4   7654  MARTIN   SALESMAN  7698.0 1981-09-28  1250.0  1400.0  30
5   7698   BLAKE    MANAGER  7839.0 1981-05-01  2850.0     NaN  30
6   7782   CLARK    MANAGER  7839.0 1981-06-09  2450.0     NaN  10
7   7788   SCOTT    ANALYST  7566.0 1982-12-09  3000.0     NaN  20
8   7839    KING  PRESIDENT     NaN 1981-11-17  5000.0     NaN  10
9   7844  TURNER   SALESMAN  7698.0 1981-09-08  1500.0     0.0  30
10  7876   ADAMS      CLERK  7788.0 1983-01-12  1100.0     NaN  20
11  7900   JAMES      CLERK  7698.0 1981-12-03   950.0     NaN  30
12  7902    FORD    ANALYST  7566.0 1981-12-03  3000.0     NaN  20
13  7934  MILLER      CLERK  7782.0 1982-01-23  1300.0     NaN  10

In [76]:
# 각 필드 특징 정보들을 뿌린다.
#(필드명, type, display_size, 내부크기, 정확도, scale, nullable, ...)
cursor.description

[('EMPNO', <cx_Oracle.DbType DB_TYPE_NUMBER>, 5, None, 4, 0, 0),
 ('ENAME', <cx_Oracle.DbType DB_TYPE_VARCHAR>, 10, 10, None, None, 1),
 ('JOB', <cx_Oracle.DbType DB_TYPE_VARCHAR>, 9, 9, None, None, 1),
 ('MGR', <cx_Oracle.DbType DB_TYPE_NUMBER>, 5, None, 4, 0, 1),
 ('HIREDATE', <cx_Oracle.DbType DB_TYPE_DATE>, 23, None, None, None, 1),
 ('SAL', <cx_Oracle.DbType DB_TYPE_NUMBER>, 11, None, 7, 2, 1),
 ('COMM', <cx_Oracle.DbType DB_TYPE_NUMBER>, 11, None, 7, 2, 1),
 ('DEPTNO', <cx_Oracle.DbType DB_TYPE_NUMBER>, 3, None, 2, 0, 1)]

In [77]:
[row[0] for row in cursor.description] #리스트컴플리헨션

['EMPNO', 'ENAME', 'JOB', 'MGR', 'HIREDATE', 'SAL', 'COMM', 'DEPTNO']

In [79]:
data_df.columns = [row[0] for row in cursor.description]

In [80]:
data_df.columns

Index(['EMPNO', 'ENAME', 'JOB', 'MGR', 'HIREDATE', 'SAL', 'COMM', 'DEPTNO'], dtype='object')

In [81]:
data_df.head() #파이썬에서는 5개만 뿌려진다. (n)숫자대로 출력.

   EMPNO   ENAME       JOB     MGR   HIREDATE     SAL    COMM  DEPTNO
0   7369   SMITH     CLERK  7902.0 1980-12-17   800.0     NaN      20
1   7499   ALLEN  SALESMAN  7698.0 1981-02-20  1600.0   300.0      30
2   7521    WARD  SALESMAN  7698.0 1981-02-22  1250.0   500.0      30
3   7566   JONES   MANAGER  7839.0 1981-04-02  2975.0     NaN      20
4   7654  MARTIN  SALESMAN  7698.0 1981-09-28  1250.0  1400.0      30

In [82]:
data_df.tail() # 파이썬에서는 5개만 뿌려진다.(n)숫자대로 출력.

    EMPNO   ENAME       JOB     MGR   HIREDATE     SAL  COMM  DEPTNO
9    7844  TURNER  SALESMAN  7698.0 1981-09-08  1500.0   0.0      30
10   7876   ADAMS     CLERK  7788.0 1983-01-12  1100.0   NaN      20
11   7900   JAMES     CLERK  7698.0 1981-12-03   950.0   NaN      30
12   7902    FORD   ANALYST  7566.0 1981-12-03  3000.0   NaN      20
13   7934  MILLER     CLERK  7782.0 1982-01-23  1300.0   NaN      10

In [83]:
cursor.close()
conn.close()

# 3절. MariaDB 데이터베이스 연결
- +)mysql 연동하는법도 같다.

In [85]:
import pymysql

In [86]:
conn = pymysql.connect(host="localhost",
                       port=3306, db="kimdb", user="root", passwd="mysql",
                       charset="utf8", autocommit=True)
conn

In [89]:
cursor = conn.cursor()
sql = "select * from personal"
cursor.execute(sql)
result = cursor.fetchall()
for r in result:
    print(r)

(1001, 'bill', 'president', None, datetime.date(1989, 1, 10), 7000, None, 10)
(1111, 'smith', 'manager', 1001, datetime.date(1990, 12, 17), 1000, None, 10)
(1112, 'ally', 'salesman', 1116, datetime.date(1991, 2, 20), 1600, 500, 30)
(1113, 'word', 'salesman', 1116, datetime.date(1992, 2, 24), 1450, 300, 30)
(1114, 'james', 'manager', 1001, datetime.date(1990, 4, 12), 3975, None, 20)
(1116, 'johnson', 'manager', 1001, datetime.date(1991, 5, 1), 3550, None, 30)
(1118, 'martin', 'analyst', 1111, datetime.date(1991, 9, 9), 3450, None, 10)
(1121, 'kim', 'clerk', 1114, datetime.date(1990, 12, 8), 4000, None, 20)
(1123, 'lee', 'salesman', 1116, datetime.date(1991, 9, 23), 1200, 0, 30)
(1226, 'park', 'analyst', 1111, datetime.date(1990, 1, 3), 2500, None, 10)

In [95]:
personal.columns

RangeIndex(start=0, stop=8, step=1)

In [96]:
import pandas as pd
personal = pd.DataFrame(result)
personal.columns = [row[0] for row in cursor.description]
personal

    pno    pname        job  manager   startdate   pay  bonus  dno
0  1001     bill  president      NaN  1989-01-10  7000    NaN   10
1  1111    smith    manager   1001.0  1990-12-17  1000    NaN   10
2  1112     ally   salesman   1116.0  1991-02-20  1600  500.0   30
3  1113     word   salesman   1116.0  1992-02-24  1450  300.0   30
4  1114    james    manager   1001.0  1990-04-12  3975    NaN   20
5  1116  johnson    manager   1001.0  1991-05-01  3550    NaN   30
6  1118   martin    analyst   1111.0  1991-09-09  3450    NaN   10
7  1121      kim      clerk   1114.0  1990-12-08  4000    NaN   20
8  1123      lee   salesman   1116.0  1991-09-23  1200    0.0   30
9  1226     park    analyst   1111.0  1990-01-03  2500    NaN   10

In [ ]:
cursor.close()
conn.close()

# 4절. 회원 입력/출력/삭제/검색 애플리케이션
- SQLite이용, Oracle이용